name: "vit_preprocessing"
backend: "dali"
max_batch_size: 4
input [
  {
    name: "INPUT_0"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUTPUT_0"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]
