name: "layoutlmv2_onnx_model"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "bbox"
    data_type: TYPE_INT64
    dims: [ -1, 4 ]
  },
  {
    name: "image"
    data_type: TYPE_UINT8
    dims: [ 3, 224, 224 ]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, 7 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
  }
]
