name: "layoutlmv2_postprocess"
backend: "python"
max_batch_size: 8

input [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1, 7 ]
  },
  {
    name: "bbox"
    data_type: TYPE_INT64
    dims: [ -1, 4 ]
  }
]

output [
  {
    name: "labels"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "bbox_out"
    data_type: TYPE_INT64
    dims: [ -1, 4 ]
  }
]
