name: "layoutlmv2_preprocess"
backend: "python"
max_batch_size: 8

input [
  {
    name: "image"
    data_type: TYPE_UINT8
    dims: [ 3, -1, -1 ]
  }
]

output [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "bbox"
    data_type: TYPE_INT64
    dims: [ -1, 4 ]
  },
  {
    name: "processed_image"
    data_type: TYPE_UINT8
    dims: [ 3, 224, 224 ]
  }
]
