name: "vit_postprocessing"
backend: "python"
max_batch_size: 4
input [
  {
    name: "INPUT_0"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
output [
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [ 2 ]
  },
  {
    name: "predicted_class"
    data_type: TYPE_INT64
    dims: [ 1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]
